## Terraform Plan
<details><summary>Show Plan</summary>

```diff


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.network.google_compute_firewall.allow_google_frontend will be created
+   resource "google_compute_firewall" "allow_google_frontend" {
+       creation_timestamp = (known after apply)
+       destination_ranges = (known after apply)
+       direction          = "INGRESS"
+       enable_logging     = (known after apply)
+       id                 = (known after apply)
+       name               = "allow-load-balancer"
+       network            = "network"
+       priority           = 1000
+       project            = (known after apply)
+       self_link          = (known after apply)
+       source_ranges      = [
+           "130.211.0.0/22",
+           "209.85.152.0/22",
+           "209.85.204.0/22",
+           "35.191.0.0/16",
        ]

+       allow {
+           ports    = []
+           protocol = "tcp"
        }
    }

  # module.network.google_compute_firewall.allow_iap will be created
+   resource "google_compute_firewall" "allow_iap" {
+       creation_timestamp = (known after apply)
+       destination_ranges = (known after apply)
+       direction          = "INGRESS"
+       enable_logging     = (known after apply)
+       id                 = (known after apply)
+       name               = "allow-iap"
+       network            = "network"
+       priority           = 1000
+       project            = (known after apply)
+       self_link          = (known after apply)
+       source_ranges      = [
+           "35.235.240.0/20",
        ]

+       allow {
+           ports    = [
+               "22",
            ]
+           protocol = "tcp"
        }
    }

  # module.network.google_compute_network.network will be created
+   resource "google_compute_network" "network" {
+       auto_create_subnetworks         = false
+       delete_default_routes_on_create = false
+       gateway_ipv4                    = (known after apply)
+       id                              = (known after apply)
+       mtu                             = (known after apply)
+       name                            = "network"
+       project                         = (known after apply)
+       routing_mode                    = (known after apply)
+       self_link                       = (known after apply)
    }

  # module.network.google_compute_subnetwork.vpc will be created
+   resource "google_compute_subnetwork" "vpc" {
+       creation_timestamp         = (known after apply)
+       external_ipv6_prefix       = (known after apply)
+       fingerprint                = (known after apply)
+       gateway_address            = (known after apply)
+       id                         = (known after apply)
+       ip_cidr_range              = "10.2.0.0/16"
+       ipv6_cidr_range            = (known after apply)
+       name                       = "vpc-subnetwork"
+       network                    = (known after apply)
+       private_ipv6_google_access = (known after apply)
+       project                    = (known after apply)
+       purpose                    = (known after apply)
+       region                     = "asia-northeast1"
+       secondary_ip_range         = (known after apply)
+       self_link                  = (known after apply)
+       stack_type                 = (known after apply)
    }

  # module.network.google_dns_managed_zone.app_dns_zone will be created
+   resource "google_dns_managed_zone" "app_dns_zone" {
+       description   = "Managed by Terraform"
+       dns_name      = "app.kotofurumiya.dev."
+       force_destroy = false
+       id            = (known after apply)
+       name          = "app-dns-zone"
+       name_servers  = (known after apply)
+       project       = (known after apply)
+       visibility    = "public"

+       dnssec_config {
+           kind          = "dns#managedZoneDnsSecConfig"
+           non_existence = (known after apply)
+           state         = "on"

+           default_key_specs {
+               algorithm  = (known after apply)
+               key_length = (known after apply)
+               key_type   = (known after apply)
+               kind       = (known after apply)
            }
        }
    }

  # module.network.google_project_service.dns will be created
+   resource "google_project_service" "dns" {
+       disable_on_destroy = true
+       id                 = (known after apply)
+       project            = (known after apply)
+       service            = "dns.googleapis.com"
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```
</details>